//---------------------------------------------------------------------------
//
//                     КЛОЧКОВ ПАВЕЛ
//             http://www.interestprograms.ru
//---------------------------------------------------------------------------


#ifndef GLOBAL_H
#define GLOBAL_H


//-----------------------------------------------------------------------------
//        ДЛЯ УДОБСТВА ВСЕ ОБЩИЕ ПЕРЕМЕННЫЕ СДЕЛАЕМ ГЛОБАЛЬНЫМИ
//               И РАСПОЛОЖИМ ИХ В ОТДЕЛЬНОМ ФАЙЛЕ
//-----------------------------------------------------------------------------
const int CARDWIDTH  = 61;// ширина карты
const int CARDHEIGHT = 80;// высота карты


// список состояний карты
enum Players {USERPLAYER=1, LEFTPLAYER, RIGHTPLAYER, TABLECARD};

//для хранения номера ходящего игрока
int GOINGPLAYER = 1;




//---------------------------------------------------------------------------
#endif